app/controllers/movies_controller.rb

  def similar
     movie = Movie.find(params[:id])
     if movie.director.blank? then
---
SELECT "movies".* FROM "movies" WHERE (director = 'George Lucas') GROUP BY title ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Mr. Big'

  def create
    @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("Directors", "created_at", "description", "director", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)